app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `customer`
SELECT COUNT(*) AS `numrows`
FROM `petugas`
SELECT COUNT(*) AS `numrows`
FROM `tickets`
SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `status` = 'open'
SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `status` = 'progress'
SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `status` = 'closed'
SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `prioritas` = 'low'
SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `prioritas` = 'medium'
SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `prioritas` = 'high'
SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `prioritas` = 'urgent'
SELECT *
FROM `tickets`
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function index()
    {
        // Mendapatkan total jumlah dari setiap tabel
        $totalCustomers = $this->customerModel->countAllResults();
        $totalPetugas = $this->petugasModel->countAllResults();
        $totalTickets = $this->ticketModel->countAllResults();

        // Mendapatkan jumlah tiket berdasarkan status
        $ticketsOpen = $this->ticketModel->where('status', 'open')->countAllResults();
        $ticketsProgress = $this->ticketModel->where('status', 'progress')->countAllResults();
        $ticketsClosed = $this->ticketModel->where('status', 'closed')->countAllResults();

        // Mendapatkan jumlah tiket berdasarkan prioritas
        $priorityLow = $this->ticketModel->where('prioritas', 'low')->countAllResults();
        $priorityMedium = $this->ticketModel->where('prioritas', 'medium')->countAllResults();
        $priorityHigh = $this->ticketModel->where('prioritas', 'high')->countAllResults();
        $priorityUrgent = $this->ticketModel->where('prioritas', 'urgent')->countAllResults();

        // Mendapatkan 5 tiket terbaru (opsional, bisa disesuaikan jumlahnya)
        $recentTickets = $this->ticketModel->orderBy('created_at', 'DESC')->limit(5)->findAll();