app/Controllers/PetugasController.php

    public function index()
    {
        $data = [
            'title'   => 'Data Petugas',
            'petugas' => $this->petugasModel->findAll(),
---
SELECT *
FROM `petugas`