app/Controllers/ProdiSuratController.php

    public function index()
    {
        $data = [
            'title' => 'Daftar Surat Keluar Prodi',
            'surat_keluar' => $this->suratKeluarModel->where('jenis_surat', 'prodi')->orderBy('id', 'DESC')->paginate(10, 'surat_prodi'),
---
SELECT *
FROM `surat_keluar`
WHERE `jenis_surat` = 'prodi'
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `surat_keluar`
WHERE `jenis_surat` = 'prodi'

    public function edit($id = null)
    {
        $surat = $this->_findSuratOr404($id);
        $mahasiswa = $this->mahasiswaModel->where('surat_keluar_id', $id)->findAll();
---
SELECT *
FROM `mahasiswa`
WHERE `surat_keluar_id` = '37'

    public function update($id = null)
    {
        $this->_findSuratOr404($id);

        if (!$this->validate($this->getValidationRules())) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $db = \Config\Database::connect();
        $db->transStart();

        try {
            $this->suratKeluarModel->update($id, [
                'nomor_surat'   => $this->request->getPost('nomor_surat'),
                'tanggal_surat' => $this->request->getPost('tanggal_surat'),
                'perihal'       => $this->request->getPost('perihal'),
                'lampiran'      => $this->request->getPost('lampiran'),
            ]);

            $this->mahasiswaModel->where('surat_keluar_id', $id)->delete();
---
UPDATE `surat_keluar` SET `nomor_surat` = '002.1/5/PTI/FT-UNA/2025', `tanggal_surat` = '2025-10-07', `perihal` = 'Usulan SK Sidang Meja Hijau', `lampiran` = NULL, `updated_at` = '2025-10-07 08:23:51'
WHERE `surat_keluar`.`id` IN ('38')
DELETE FROM `mahasiswa`
WHERE `surat_keluar_id` = '38'

                $penguji2 = $this->request->getPost('dosen_penguji_2')[$key] ?? '';
                $dosenPenguji = trim("1. {$penguji1}\n2. {$penguji2}");

                $this->mahasiswaModel->insert([
                    'surat_keluar_id'   => $id,
                    'npm'               => $npm,
                    'nama_mahasiswa'    => $this->request->getPost('nama_mahasiswa')[$key],
                    'perusahaan'        => $this->request->getPost('perusahaan')[$key] ?? null,
                    'alamat_perusahaan' => $this->request->getPost('alamat_perusahaan')[$key] ?? null,
                    'judul'             => $this->request->getPost('judul')[$key] ?? null,
                    'dosen_pembimbing'  => $this->request->getPost('dosen_pembimbing')[$key] ?? null,
                    'waktu_pelaksanaan' => $this->request->getPost('waktu_pelaksanaan')[$key] ?? null,
                    'dosen_pembanding'  => $dosenPembanding ?: null,
                    'dosen_penguji'     => $dosenPenguji ?: null,
                ]);
---
INSERT INTO `mahasiswa` (`surat_keluar_id`, `npm`, `nama_mahasiswa`, `perusahaan`, `alamat_perusahaan`, `judul`, `dosen_pembimbing`, `waktu_pelaksanaan`, `dosen_pembanding`, `dosen_penguji`, `created_at`, `updated_at`) VALUES ('38', '21012066', 'Khairul Badri', NULL, NULL, 'Analisisi Listrik PLN Sigura gura', 'M.yasin S.kom M.Kom', NULL, '1. \n2.', '1. penguji 1\n2. penguji 2', '2025-10-07 08:23:51', '2025-10-07 08:23:51')

    public function exportPdf($id = null)
    {
        $surat = $this->_findSuratOr404($id);
        $mahasiswa = $this->mahasiswaModel->where('surat_keluar_id', $id)->findAll();
---
SELECT *
FROM `mahasiswa`
WHERE `surat_keluar_id` = '28'

    private function _findSuratOr404($id)
    {
        if (!$id) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('ID Surat tidak disediakan.');
        }
        $surat = $this->suratKeluarModel->where(['id' => $id, 'jenis_surat' => 'prodi'])->first();
---
SELECT *
FROM `surat_keluar`
WHERE `id` = '38'
AND `jenis_surat` = 'prodi'
 LIMIT 1