app/Controllers/Selisih.php

    public function edit($id_selisih)
    {
        $data = [
            'active_menu' => 'selisih',
            'title' => 'Edit Data Selisih',
            'validation' => \Config\Services::validation(),
            'selisih' => $this->selisihModel->find($id_selisih),
            'kecamatans' => $this->selisihModel->getKecamatanForDropdown(),
            'jumlah_gurus' => $this->selisihModel->getJumlahGuruForDropdown(),
            'years' => $this->getAvailableYears(),
        ];
---
SELECT *
FROM `selisih`
WHERE `selisih`.`id_selisih` = '20'

        // Tentukan keterangan
        $keterangan = ($nilai_selisih < 0) ? 'kekurangan' : 'kelebihan';

        $this->selisihModel->update($id_selisih, [
            'tahun' => $tahun,
            'kecamatan_id' => $kecamatan_id, // Simpan nilai id_prediksi
            'hasil_prediksi_id' => $hasil_prediksi,
            'jumlah_guru_id' => $jumlah_guru,
            'kebutuhan' => $kebutuhan,
            'nilai_selisih' => $nilai_selisih,
            'keterangan' => $keterangan,
        ]);
---
UPDATE `selisih` SET `tahun` = '2025', `kecamatan_id` = '1329', `hasil_prediksi_id` = '1720', `jumlah_guru_id` = '98', `kebutuhan` = 86, `nilai_selisih` = -12, `keterangan` = 'kelebihan', `updated_at` = '2025-07-18 15:20:58'
WHERE `selisih`.`id_selisih` IN ('20')