app/Controllers/TicketController.php

SELECT *
FROM `tickets`
---
    public function index()
    {
        $data = [
            'title'       => 'Daftar Tiket',
            'tickets'     => $this->ticketModel->findAll(),

SELECT *
FROM `customer`
SELECT *
FROM `petugas`
---
    public function create()
    {
        $customers = $this->customerModel->findAll();
        $petugas = $this->petugasModel->findAll();

INSERT INTO `tickets` (`code_ticket`, `customer_id`, `nama_customer_ticket`, `alamat_customer_ticket`, `no_hp_customer_ticket`, `keluhan`, `deskripsi`, `status`, `prioritas`, `tanggal_buat`, `petugas_id`, `nama_petugas_ticket`, `no_hp_petugas_ticket`, `role_petugas_ticket`, `created_at`, `updated_at`) VALUES ('TKT-20250731083620-5756', '6', 'nona amon', 'Desa Sei Apung Kecamatan Tanjung Balai Kabupaten Asahan', '6282267366082', 'sdsd', 'dsds', 'open', 'low', '2025-07-31 08:36:31', '5', 'Khairul Badri', '6282267366082', 'noc', '2025-07-31 08:36:31', '2025-07-31 08:36:31')
---
    public function store()
    {
        // Tangkap semua data dari POST
        $dataToSave = [
            'code_ticket'            => $this->request->getPost('code_ticket'),
            'customer_id'            => $this->request->getPost('customer_id'),
            'nama_customer_ticket'   => $this->request->getPost('nama_customer_ticket'),
            'alamat_customer_ticket' => $this->request->getPost('alamat_customer_ticket'),
            'no_hp_customer_ticket'  => $this->request->getPost('no_hp_customer_ticket'),
            'keluhan'                => $this->request->getPost('keluhan'),
            'deskripsi'              => $this->request->getPost('deskripsi'),
            'status'                 => $this->request->getPost('status'),
            'prioritas'              => $this->request->getPost('prioritas'),
            'tanggal_buat'           => date('Y-m-d H:i:s'), // Set tanggal_buat saat ini
            'petugas_id'             => $this->request->getPost('petugas_id'),
            'nama_petugas_ticket'    => $this->request->getPost('nama_petugas_ticket'),
            'no_hp_petugas_ticket'   => $this->request->getPost('no_hp_petugas_ticket'),
            'role_petugas_ticket'    => $this->request->getPost('role_petugas_ticket'),
        ];

        // Validasi data
        if (!$this->validate($this->ticketModel->validationRules, $dataToSave, $this->ticketModel->validationMessages)) {
            // Jika validasi gagal, kembalikan ke form dengan input lama
            return redirect()->back()->withInput();
        }

        // Simpan data ke database
        $insertResult = $this->ticketModel->insert($dataToSave);

SELECT *
FROM `tickets`
WHERE `tickets`.`id` = '1'
SELECT *
FROM `customer`
SELECT *
FROM `petugas`
---
    public function edit($id)
    {
        $ticket = $this->ticketModel->find($id);

        if (!$ticket) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Tiket tidak ditemukan.');
        }

        $customers = $this->customerModel->findAll();
        $petugas = $this->petugasModel->findAll();

DELETE FROM `tickets`
WHERE `id` IN ('3')
---
    public function delete($id)
    {
        $this->ticketModel->delete($id);

SELECT *
FROM `customer`
WHERE `customer`.`id` = '6'
---
    public function getCustomerDetails($customer_id)
    {
        $customer = $this->customerModel->find($customer_id);