app/Models/SelisihModel.php

SELECT MIN(id_prediksi) as id_prediksi, `kecamatan`
FROM `prediksi`
GROUP BY `kecamatan`
---
    public function getKecamatanForDropdown($tahun = null)
    {
        $builder = $this->db->table('prediksi');
        // Menggunakan MIN(id_prediksi) untuk mendapatkan satu id_prediksi per kecamatan unik
        $builder->select('MIN(id_prediksi) as id_prediksi, kecamatan');
        if ($tahun) {
            $builder->where('tahun', $tahun);
        }
        $builder->groupBy('kecamatan'); // Grouping by kecamatan
        // Order by kecamatan for better display in dropdown
        return $builder->get()->getResultArray();

SELECT `hasil_prediksi`
FROM `prediksi`
WHERE `id_prediksi` = '1329'
AND `tahun` = '2025'
---
    public function getHasilPrediksi($id_prediksi, $tahun)
    {
        return $this->db->table('prediksi')
            ->select('hasil_prediksi')
            ->where('id_prediksi', $id_prediksi)
            ->where('tahun', $tahun)
            ->get()
            ->getRowArray();

SELECT `id_guru`, `jumlah`
FROM `guru`
---
    public function getJumlahGuruForDropdown($tahun = null, $kecamatan_id = null)
    {
        $builder = $this->db->table('guru');
        $builder->select('id_guru, jumlah');
        if ($tahun) {
            $builder->where('tahun', $tahun);
        }
        if ($kecamatan_id) {
            // Ini perlu disesuaikan jika tabel guru memiliki kolom kecamatan_id
            // Atau Anda bisa melakukan query JOIN di model jika relasi kompleks.
            // Jika ada relasi: $builder->where('kecamatan_id', $kecamatan_id);
        }
        return $builder->get()->getResultArray();

SELECT `jumlah`
FROM `guru`
WHERE `id_guru` = '70'
---
    public function getGuruById($id_guru)
    {
        return $this->db->table('guru')
            ->select('jumlah')
            ->where('id_guru', $id_guru)
            ->get()
            ->getRowArray();

SELECT `selisih`.*, `prediksi`.`kecamatan`
FROM `selisih`
LEFT JOIN `prediksi` ON `prediksi`.`id_prediksi` = `selisih`.`kecamatan_id`
---
    public function getSelisihWithKecamatan()
    {
        return $this->db->table($this->table)
            ->select('selisih.*, prediksi.kecamatan') // Pilih semua kolom selisih dan nama kecamatan dari prediksi
            ->join('prediksi', 'prediksi.id_prediksi = selisih.kecamatan_id', 'left')
            ->get()
            ->getResultArray();