app/Models/SuratKeluarModel.php

SELECT *
FROM `surat_keluar`
WHERE `nomor_surat` LIKE '%/PTI/FT-UNA/2025' ESCAPE '!'
ORDER BY `id` DESC
 LIMIT 1
---
    public function generateNomorSurat($tipeSurat = '')
    {
        // 1. Definisikan kode awalan yang statis untuk semua surat
        $kodeTipe = '002.1';
        $tahunSekarang = date('Y');
        $kodeAkhiran = "/PTI/FT-UNA/{$tahunSekarang}";

        // 2. Cari nomor surat terakhir di database, TANPA memandang tipe surat, hanya berdasarkan tahun
        $lastSurat = $this->like('nomor_surat', $kodeAkhiran, 'before') // cari yang tahunnya sama
            ->orderBy('id', 'DESC')
            ->first();